In [1]:
%reload_ext sql
%sql postgresql+psycopg2://postgres:postgres@localhost/demo

In [2]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Window Function Rank

##### Row number

Assigning unique row number in incremental order

In [13]:
%%sql
select driver_id, fare,
    ROW_NUMBER() over(order by fare desc) as row_num
from ride;

 * postgresql+psycopg2://postgres:***@localhost/demo
7 rows affected.

[(101, Decimal('500.00'), 1),
 (101, Decimal('500.00'), 2),
 (101, Decimal('500.00'), 3),
 (102, Decimal('500.00'), 4),
 (102, Decimal('500.00'), 5),
 (103, Decimal('200.00'), 6),
 (104, Decimal('100.00'), 7)]

In [14]:
%%sql
select driver_id, fare,
    ROW_NUMBER() over(partition by driver_id order by fare desc) as row_num
from ride;

 * postgresql+psycopg2://postgres:***@localhost/demo
7 rows affected.

[(101, Decimal('500.00'), 1),
 (101, Decimal('500.00'), 2),
 (101, Decimal('500.00'), 3),
 (102, Decimal('500.00'), 1),
 (102, Decimal('500.00'), 2),
 (103, Decimal('200.00'), 1),
 (104, Decimal('100.00'), 1)]

### Deduplication using ROW_NUMBER window function

In [16]:
%%sql
with row_num_cte as(
    select employeeid, name, department, HireDate,
    ROW_NUMBER() OVER(partition by employeeid order by HireDate asc) as row_num

from Employees
)

select employeeid, name, department, HireDate
from row_num_cte
where row_num=1;

 * postgresql+psycopg2://postgres:***@localhost/demo
3 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 5, 1)),
 (2, 'Bob', 'IT', datetime.date(2021, 7, 10)),
 (3, 'Charlie', 'Finance', datetime.date(2020, 9, 30))]

#### Rank

In [10]:
%%sql
select * from students;

 * postgresql+psycopg2://postgres:***@localhost/demo
3 rows affected.

[('Ruba', 22), ('Thaya', 22), ('Rama', 28)]

In [17]:
%%sql
select name, score,
RANK() over(order by score) as rank_no
from students;

 * postgresql+psycopg2://postgres:***@localhost/demo
6 rows affected.

[('Nithy', 10, 1),
 ('Ruba', 22, 2),
 ('Thaya', 22, 2),
 ('Rama', 28, 4),
 ('Ruban', 28, 4),
 ('karthi', 35, 6)]

#### Dense rank

** if two elements have same rank, next rank will be in order.

In [18]:
%%sql
select name, score,
DENSE_RANK() over(order by score) as rank_no
from students;

 * postgresql+psycopg2://postgres:***@localhost/demo
6 rows affected.

[('Nithy', 10, 1),
 ('Ruba', 22, 2),
 ('Thaya', 22, 2),
 ('Rama', 28, 3),
 ('Ruban', 28, 3),
 ('karthi', 35, 4)]

#### Percent Rank

In [16]:
%%sql
select name, score,
PERCENT_RANK() over(order by score) as rank_no
from students;

 * postgresql+psycopg2://postgres:***@localhost/demo
6 rows affected.

[('Nithy', 10, 0.0),
 ('Ruba', 22, 0.2),
 ('Thaya', 22, 0.2),
 ('Rama', 28, 0.6),
 ('Ruban', 28, 0.6),
 ('karthi', 35, 1.0)]

In [20]:
%%sql
select * from EmployeeSales;

 * postgresql+psycopg2://postgres:***@localhost/demo
10 rows affected.

[(1, 'Alice', Decimal('10000.00')),
 (2, 'Bob', Decimal('8500.00')),
 (3, 'Charlie', Decimal('7500.00')),
 (4, 'David', Decimal('6000.00')),
 (5, 'Eva', Decimal('11000.00')),
 (6, 'Frank', Decimal('4500.00')),
 (7, 'Grace', Decimal('3000.00')),
 (8, 'Hank', Decimal('4000.00')),
 (9, 'Ivy', Decimal('8000.00')),
 (10, 'Jack', Decimal('9500.00'))]

#### NTILE

In [29]:
%%sql
select EmployeeName,SalesAmount,
NTILE(4) over(order by SalesAmount desc) as cat
from EmployeeSales;

 * postgresql+psycopg2://postgres:***@localhost/demo
10 rows affected.

[('Eva', Decimal('11000.00'), 1),
 ('Alice', Decimal('10000.00'), 1),
 ('Jack', Decimal('9500.00'), 1),
 ('Bob', Decimal('8500.00'), 2),
 ('Ivy', Decimal('8000.00'), 2),
 ('Charlie', Decimal('7500.00'), 2),
 ('David', Decimal('6000.00'), 3),
 ('Frank', Decimal('4500.00'), 3),
 ('Hank', Decimal('4000.00'), 4),
 ('Grace', Decimal('3000.00'), 4)]